                                               #დავალება N-5

print("იაკობი — ნაწარმოების ავტორი, მღვდელი.")

print("ვარსქენი — ქვემო ქართლის ერისმთავარი, ანუ პიტიახში 482 წლამდე, არშუშა პიტიახშის ძე (ვახტანგ გორგასლის ბრძანებით ვარსქენს თავი მოჰკვეთეს სამშობლოს ღალატის გამო).")

print("შუშანიკის შვილები — სამი ძე და ერთი ასული.")

print("აფოცი — საპიტიახშოს ეპისკოპოსი.")

print("აფოცი — საპიტიახშოს ეპისკოპოსი.")

print("ჯოჯიკი — ვარსქენის ძმა.")

print("ჯოჯიკის ცოლი — რომელსაც დედოფალმა ჭიქა სახეში შეალეწა და ღვინო ძირს დააქცია.")

print("სპარსეთის მეფის ასული - ვარსქენის მეორე ცოლი")

print("კაცი ვინმე სპარსი — ის სამჯერ ჩნდება ნაწარმოებში, ვარაუდობენ, რომ ვარსქენთან დაახლოებული პირი იყო.")

print("ვარდან მამიკონიანი — შუშანიკის მამა (მოხსენიებულია ნაწარმოებში).")

print("არშუშა — ვარსქენის მამა (მოხსენიებულია ნაწარმოებში).")

print("სამოელი — თავი ეპისკოპოსთა - კათალიკოსი.")

print("იოანე — ეპისკოპოსი.")

print("დიაკვანი — რომელსაც უნდა ეთქვა დედოფლისათვის „მტკიცედ დეგ“, მაგრამ პიტიახშისგან შეშინებულმა მხოლოდ ამის თქმა მოასწრო: „მტკი…“.")

print("კაცი ვინმე წმინდა — ანუ ბერი, ვისთანაც აფოცი და იაკობი იყვნენ წასულნი რაღაცის საკითხავად.")

print("ვინმე ხუცესი — ანუ მღვდელი, რომელსაც ვარსქენმა კვერთხი ჩაარტყა ზურგში.")

print("სპარსთა მეფე — ნაწარმოებში მოხსენიებული სპარსთა მეფე არის პეროზი (459—484)")

print("ვინმე ჭაბუკი — რომელმაც იაკობს ვარსქენის დანაბარები გადასცა, რომ მას ხლებოდა.")

print("კარისკაცი — რომელმაც შეუშვა იაკობი დედოფლის სანახავად.")

print("კარისკაცი — რომელიც იაკობმა ქრთამით, საჩუქრით გადმოიბირა, რათა შუშანიკთან შეეშვა.")

print("მსახური — რომელიც სპარსეთიდან ახლადდაბრუნებულმა პიტიახშმა „სადიასპანოჲთა ცხენითა“ გამოაგზავნა დედოფალთან ამბის საკითხად.")

print("მოციქული — რომელიც ვარსქენმა დედოფალთან გააგზავნა შემდეგი სიტყვებით: თუ სასახლეში არ დაბრუნდები, „ჩორდ წარგცე შენ ანუ კარად კარაულითა“.")

print("ძიძიშვილი — რომელიც ვარსქენმა შუშანიკთან შეაგზავნა გადმოსაბირებლად.")

print("ვიღაც ადამიანი — რომელიც მივიდა დედოფალთან და უთხრა: კარგად მიუგე ვარსქენს პასუხი, მას შენი მოტყუება უნდოდა და სხვა ბოროტეული განზრახვა ჰქონდა შენთვის.")

#შუშანიკის წამება სტროფების რაოდენობა: 1662 

#შესრულებულია 101/100   A+