# №1- დავალება


# მონაცემთა ტიპი data type
# string - str - პრჭყალებში აღნიშნული ტექსტი
# integer -int- აღნიშნავს მთელ რიცხვს
# float- ათწილად რიცხვებს


# №2- დავალება

#Full Stack Developer

#სრული სტეკის დეველოპერები ქმნიან და ქმნიან ვებსაიტებსა და აპლიკაციებს სხვადასხვა პლატფორმისთვის. 
#სრული სტეკის დეველოპერის სამუშაოს აღწერა შეიძლება შეიცავდეს შემდეგს


#ვებ სერვისებისა და ინტერფეისების შემუშავება და შენარჩუნება
#შეიტანეთ წვლილი წინა და უკანა ნაწილის განვითარების პროცესებში
#შექმენით ახალი პროდუქტის ფუნქციები ან API
#შეასრულეთ ტესტები, მოაგვარეთ პროგრამული უზრუნველყოფის პრობლემები და გამოასწორეთ შეცდომები
#ითანამშრომლეთ სხვა დეპარტამენტებთან პროექტებსა და სპრინტებზე

#Back End Development 

#როდესაც ბრაუზერში შედიხართ ვებგვერდზე,
#თქვენ არსებითად ითხოვთ სერვერზე შენახული ფაილის ნახვას სადმე.
#როდესაც პირველად ატვირთავთ ვებგვერდს ან შედიხართ ვებსაიტზე მომხმარებლის სახელითა და პაროლით,
#ეს არის Back-End Developers, რომელიც შესაძლებელს ხდის ვებსაიტის ინფორმაციაზე ეფექტურად და უსაფრთხოდ წვდომას.

#Web Development

#ვებ დეველოპერის სამუშაოა ვებსაიტების შექმნა.
#მიუხედავად იმისა,
#რომ მათი მთავარი როლი არის უზრუნველყოს ვებსაიტი ვიზუალურად მიმზიდველი და მარტივი ნავიგაცია,
#ბევრი ვებ დეველოპერი ასევე პასუხისმგებელია ვებსაიტის მუშაობასა და შესაძლებლობებზე.


#End